app/controllers/articles_controller.rb

SELECT * FROM "articles"
---
  def index
    @articles = Article.all

SELECT * FROM "articles" WHERE ("articles"."id" = 1)
---
  def show
    @article = Article.find(params[:id])

INSERT INTO "articles" ("e_publish", "page_title", "created_at", "image_file_name", "title", "image_file_size", "s_publish", "updated_at", "section_id", "image_content_type", "meta", "content", "status", "image_updated_at", "keywords") VALUES(NULL, 'Lorem Ipsum', '2009-07-06 22:08:15', NULL, 'Lorem Ipsum', NULL, NULL, '2009-07-06 22:08:15', 3, NULL, '', '<p>Le <strong>Lorem Ipsum</strong> est simplement du faux texte employ&eacute; dans la composition et la mise en page avant impression. Le Lorem Ipsum est le faux texte standard de l''imprimerie depuis les ann&eacute;es 1500, quand un peintre anonyme assembla ensemble des morceaux de texte pour r&eacute;aliser un livre sp&eacute;cimen de polices de texte. <!-- pagebreak -->Il n''a pas fait que survivre cinq si&egrave;cles, mais s''est aussi adapt&eacute; &agrave; la bureautique informatique, sans que son contenu n''en soit modifi&eacute;. Il a &eacute;t&eacute; popularis&eacute; dans les ann&eacute;es 1960 gr&acirc;ce &agrave; la vente de feuilles Letraset contenant des passages du Lorem Ipsum, et, plus r&eacute;cemment, par son inclusion dans des applications de mise en page de texte, comme Aldus PageMaker.</p>', 'f', NULL, '')
---
  def create
    @article = Article.new(params[:article])
    if @article.save

SELECT * FROM "articles" WHERE ("articles"."id" = 1)
---
  def edit
    @article = Article.find(params[:id])

SELECT * FROM "articles" WHERE ("articles"."id" = 1)
UPDATE "articles" SET "updated_at" = '2009-07-06 22:53:00', "content" = '<p>Le <strong>Lorem Ipsum</strong> est simplement du faux texte employ&eacute; dans la composition et la mise en page avant impression. Le Lorem Ipsum est le faux texte standard de l''imprimerie depuis les ann&eacute;es 1500, quand un peintre anonyme assembla ensemble des morceaux de texte pour r&eacute;aliser un livre sp&eacute;cimen de polices de texte. Il n''a pas fait que survivre cinq si&egrave;cles, mais s''est aussi adapt&eacute; &agrave; la bureautique informatique, sans que son contenu n''en soit modifi&eacute;. Il a &eacute;t&eacute; popularis&eacute; dans les ann&eacute;es 1960 gr&acirc;ce &agrave; la vente de feuilles<!-- pagebreak --> Letraset contenant des passages du Lorem Ipsum, et, plus r&eacute;cemment, par son inclusion dans des applications de mise en page de texte, comme Aldus PageMaker.</p>' WHERE "id" = 1
---
  def update
    @article = Article.find(params[:id])
    if @article.update_attributes(params[:article])

SELECT * FROM "sections" ORDER BY title
---
  	def load_sections
  		@sections = Section.all :order => 'title'