app/controllers/sections_controller.rb

  def index
    @sections = Section.all
---
SELECT * FROM "sections"

  def show
    @section = Section.find(params[:id])
---
SELECT * FROM "sections" WHERE ("sections"."id" = 1)

  def edit
    @section = Section.find(params[:id])
---
SELECT * FROM "sections" WHERE ("sections"."id" = 2)

  def create
    @section = Section.new(params[:section])

    respond_to do |format|
      if @section.save
---
INSERT INTO "sections" ("created_at", "image_file_name", "title", "image_file_size", "updated_at", "image_content_type", "meta", "content", "status", "image_updated_at", "keywords") VALUES('2009-07-03 05:16:47', 'hacker.jpg', 'Section blog', 25997, '2009-07-03 05:16:47', 'image/jpeg', '', '<div style="text-align: justify;">Proinde concepta rabie saeviore, quam desperatio incendebat et fames,

  def update
    @section = Section.find(params[:id])

    respond_to do |format|
      if @section.update_attributes(params[:section])
---
SELECT * FROM "sections" WHERE ("sections"."id" = 3)
UPDATE "sections" SET "updated_at" = '2009-07-03 06:30:06', "title" = 'Section 3' WHERE "id" = 3